#include<stdio.h>

/**********************************
 * 功能: 按键MODE  
 * 参数: 无
 * 返回: 无
**********************************/
void key_MODE()
 {
  static int k = 0;
   if(Trg == 0x01)
    if(++k <= 2)
   if(Csum == 0x01){
     if(++k <= 4) 
      } 
     if(Csum == 0x00) k=0;
  }

/**********************************
 * 功能: 按键SET  
 * 参数: 无
 * 返回: 无
**********************************/
void key_SET()
 {
  static int k = 0;
   if(Trg == 0x02)
    if(++k <= 2)
   if(Csum == 0x02){
     if(++k <= 4) 
  
      } 
     if(Csum == 0x00) k=0;
  }

/**********************************
 * 功能: 按键12/24  
 * 参数: 无
 * 返回: 无
**********************************/
void key_12_24()
 {
  static int k = 0;
   if(Trg == 0x04)
     if(++k <= 2)
   if(Csum == 0x04){
     if(++k <= 4) 
       
      } 
     if(Csum == 0x00) k=0;
  }

/**********************************
 * 功能: 按键MAX/MIN  
 * 参数: 无
 * 返回: 无
**********************************/
void key_MAX_MIN()
 {
  static int k = 0;
   if(Csum == 0x08){
     if(++k == 2) 
       
      } 
     if(Csum == 0x00) k=0;
  }
